In [1]:
import pandas as pd

In [2]:
people = {"first" : ["first1", "first2", "first3"], 
          "last" : ["last1", "last2", "last3"], 
          "email" : ["email1", "email2", "email3"]}

df = pd.DataFrame(people)

In [3]:
df

    first   last   email
0  first1  last1  email1
1  first2  last2  email2
2  first3  last3  email3

In [4]:
df['first'] + ' ' + df['last']

0    first1 last1
1    first2 last2
2    first3 last3
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']

In [6]:
df

    first   last   email     full_name
0  first1  last1  email1  first1 last1
1  first2  last2  email2  first2 last2
2  first3  last3  email3  first3 last3

In [7]:
df.drop(columns = ['first', 'last'])

    email     full_name
0  email1  first1 last1
1  email2  first2 last2
2  email3  first3 last3

In [8]:
df.drop(columns = ['first', 'last'], inplace = True)

In [9]:
df

    email     full_name
0  email1  first1 last1
1  email2  first2 last2
2  email3  first3 last3

In [10]:
df['full_name'].str.split(' ')

0    [first1, last1]
1    [first2, last2]
2    [first3, last3]
Name: full_name, dtype: object

In [11]:
df['full_name'].str.split(' ', expand = True)

        0      1
0  first1  last1
1  first2  last2
2  first3  last3

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [13]:
df

    email     full_name   first   last
0  email1  first1 last1  first1  last1
1  email2  first2 last2  first2  last2
2  email3  first3 last3  first3  last3

In [26]:
df._append({'first': 'app_endfirstname'}, ignore_index = True)

    email     full_name             first   last
0  email1  first1 last1            first1  last1
1  email2  first2 last2            first2  last2
2  email3  first3 last3            first3  last3
3     NaN           NaN  app_endfirstname    NaN

In [29]:
people = {"first" : ["df2first1", "df2first2"], 
          "last" : ["df2last1", "df2last2"], 
          "email" : ["df2email1", "df2email2"]}

df2 = pd.DataFrame(people)

In [30]:
df2

       first      last      email
0  df2first1  df2last1  df2email1
1  df2first2  df2last2  df2email2

In [31]:
df._append(df2, ignore_index = True)

       email     full_name      first      last
0     email1  first1 last1     first1     last1
1     email2  first2 last2     first2     last2
2     email3  first3 last3     first3     last3
3  df2email1           NaN  df2first1  df2last1
4  df2email2           NaN  df2first2  df2last2

In [32]:
df._append(df2, ignore_index = True, sort = False)

       email     full_name      first      last
0     email1  first1 last1     first1     last1
1     email2  first2 last2     first2     last2
2     email3  first3 last3     first3     last3
3  df2email1           NaN  df2first1  df2last1
4  df2email2           NaN  df2first2  df2last2

In [33]:
df = df._append(df2, ignore_index = True, sort = False)
df

       email     full_name      first      last
0     email1  first1 last1     first1     last1
1     email2  first2 last2     first2     last2
2     email3  first3 last3     first3     last3
3  df2email1           NaN  df2first1  df2last1
4  df2email2           NaN  df2first2  df2last2

In [34]:
df.drop(index = 4)

       email     full_name      first      last
0     email1  first1 last1     first1     last1
1     email2  first2 last2     first2     last2
2     email3  first3 last3     first3     last3
3  df2email1           NaN  df2first1  df2last1

In [38]:
filt = df['last'] == 'last3'
df.drop(index = df[filt].index)
#or
#df.drop(index = df[df['last'] == 'last3'].index)

       email     full_name      first      last
0     email1  first1 last1     first1     last1
1     email2  first2 last2     first2     last2
3  df2email1           NaN  df2first1  df2last1
4  df2email2           NaN  df2first2  df2last2